# GetPhaseStatuses Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementPhaseStatusFilter..::..GetPhaseStatuses Method
ElementPhaseStatusFilter Class See Also
---
Returns the phase statuses assigned to this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<ElementOnPhaseStatus> GetPhaseStatuses()
```

Visual Basic
---
```text
Public Function GetPhaseStatuses As ICollection(Of ElementOnPhaseStatus)
```

Visual C++
---
```text
public:
ICollection<ElementOnPhaseStatus>^ GetPhaseStatuses()
```

# ### Return Value
The phase statuses.
# See Also
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace